package BaekJoon;

/*
    앉았다 = 섯다와 비슷하게 만든 게임, 1~10까지 쓰인 카드 2장씩 총 20장으로 2명이 참여.
        두 명의 참가자는 순서대로 20장의 카드 중 무작위로 2장의 카드를 가져온다.
        상대방이 이미 가지고 간 카드를 중복해서 가져올 수는 없다. 그리고 자신은 어떤 카드를 가져왔는지 알 수 있지만, 상대방이 어떤 카드를 가져갔는지는 알 수 없다.
        서로의 패를 공개한다.
        강한 족보의 패를 가진 사람이 이긴다. 만약 두 참가자가 같은 족보의 패를 가졌다면 비긴다.
    족보는 섯다 족보 그거
    영학이의 패가 입력으로 주어졌을 때 이길 수 있는 확률 구하기.
    *이길 확률을 소수점 이하 셋 째 자리까지 반올림해서 출력
    *뒤따르는 0도 출력해야 한다. 예를 들어, '0.700'을 출력했다면 정답이고, '0.7'을 출력했다면 오답!
 */

import java.util.Scanner;

public class Main_BJ14717 {                                      //앉았다
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);

        int a = sc.nextInt();
        int b = sc.nextInt();
        int n = 153;                                    //전체 경우의 수, 18장 중 2개를 뽑는 경우의 수
        int cnt = 0;
        int sum = (a + b) % 10;                         //영학이 끗 계산

        //땡인지 아닌지 구분
        if(a == b){                                   //땡이면
            cnt = n - (10 - a);                          //a땡보다 하위의 족보 갯수 세기 (상위의 족보 개수를 전체에서 뺌)
        } else{                                         //끗이면
            for(int i = 1; i <= 10; i++){
                for(int j = i + 1; j <= 10; j++){
                    int tmp = (i + j) % 10;             //상대의 끗 계산

                    if(tmp < sum){                      //영학이가 이기는 경우라면
                        if(a == i || a == j || b == i || b == j){           //상대와 내가 같은 수를 가지고 있으면 해당 끗이 나오는 수의 조합이 2가지
                            cnt += 2;
                        } else{
                            cnt += 4;                                       //그거 아니면 4가지
                        }
                    }
                }
            }
        }

        System.out.printf("%.3f", cnt / (n * 1.0));
    }
}
